# Pandas Tutorial
###### https://pandas.pydata.org/docs/user_guide/10min.html

In [183]:
import numpy as np
import pandas as pd

In [184]:
s = pd.Series([1,3,5,np.nan,6,8])

In [185]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [186]:
dates = pd.date_range('20130101',periods=6)

In [187]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [188]:
df = pd.DataFrame(np.random.randn(6,4), index=dates,columns =list('ABCD'))

In [189]:
df

                   A         B         C         D
2013-01-01 -1.182150 -0.508874  0.014910  0.490079
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340 -0.462846 -0.149674  0.615237
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710
2013-01-06  0.926247 -0.488644 -0.373304  1.756561

In [190]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3] * 4, dtype='int32'),
                    'E': pd.Categorical(["test", "train", "test", "train"]),
                    'F': 'foo'})

In [191]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [192]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [193]:
#df2.<Tab>

In [194]:
df.head()

                   A         B         C         D
2013-01-01 -1.182150 -0.508874  0.014910  0.490079
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340 -0.462846 -0.149674  0.615237
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710

In [195]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710
2013-01-06  0.926247 -0.488644 -0.373304  1.756561

In [196]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [197]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [198]:
df.to_numpy() #number로 바꿈

array([[-1.18214968, -0.50887367,  0.01490987,  0.49007862],
       [ 0.51116339,  0.72369904,  1.34415087,  1.47700337],
       [ 1.54133985, -0.46284642, -0.14967364,  0.61523683],
       [-0.75193431,  0.02261855, -0.37546543, -0.33488646],
       [ 0.4998908 , -0.05127333, -0.22167659, -3.17570972],
       [ 0.92624709, -0.48864404, -0.37330425,  1.75656086]])

In [199]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.257426 -0.127553  0.039823  0.138047
std    1.030545  0.477748  0.655640  1.787103
min   -1.182150 -0.508874 -0.375465 -3.175710
25%   -0.438978 -0.482195 -0.335397 -0.128645
50%    0.505527 -0.257060 -0.185675  0.552658
75%    0.822476  0.004146 -0.026236  1.261562
max    1.541340  0.723699  1.344151  1.756561

In [200]:
df.T #행과 열 교환

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.182150    0.511163    1.541340   -0.751934    0.499891    0.926247
B   -0.508874    0.723699   -0.462846    0.022619   -0.051273   -0.488644
C    0.014910    1.344151   -0.149674   -0.375465   -0.221677   -0.373304
D    0.490079    1.477003    0.615237   -0.334886   -3.175710    1.756561

In [238]:
df.sort_index(axis=1, ascending=False)

              F  D         C         B         A
2013-01-01  NaN  5  0.014910  0.000000  0.000000
2013-01-02  1.0  5  1.344151  0.723699  0.511163
2013-01-03  2.0  5 -0.149674 -0.462846  1.541340
2013-01-04  3.0  5 -0.375465  0.022619 -0.751934
2013-01-05  4.0  5 -0.221677 -0.051273  0.499891
2013-01-06  5.0  5 -0.373304 -0.488644  0.926247

In [204]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01 -1.182150 -0.508874  0.014910  0.490079
2013-01-06  0.926247 -0.488644 -0.373304  1.756561
2013-01-03  1.541340 -0.462846 -0.149674  0.615237
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886
2013-01-02  0.511163  0.723699  1.344151  1.477003

In [205]:
df['A']

2013-01-01   -1.182150
2013-01-02    0.511163
2013-01-03    1.541340
2013-01-04   -0.751934
2013-01-05    0.499891
2013-01-06    0.926247
Freq: D, Name: A, dtype: float64

In [206]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.182150 -0.508874  0.014910  0.490079
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340 -0.462846 -0.149674  0.615237

In [207]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340 -0.462846 -0.149674  0.615237
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886

In [208]:
df.loc[dates[0]] #라벨에 따라 가져옴. l월1일 데이터

A   -1.182150
B   -0.508874
C    0.014910
D    0.490079
Name: 2013-01-01 00:00:00, dtype: float64

In [209]:
df

                   A         B         C         D
2013-01-01 -1.182150 -0.508874  0.014910  0.490079
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340 -0.462846 -0.149674  0.615237
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710
2013-01-06  0.926247 -0.488644 -0.373304  1.756561

In [210]:
df.loc[:, ['A','B']] #A,B열 가져옴

                   A         B
2013-01-01 -1.182150 -0.508874
2013-01-02  0.511163  0.723699
2013-01-03  1.541340 -0.462846
2013-01-04 -0.751934  0.022619
2013-01-05  0.499891 -0.051273
2013-01-06  0.926247 -0.488644

In [211]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  0.511163  0.723699
2013-01-03  1.541340 -0.462846
2013-01-04 -0.751934  0.022619

In [212]:
df.loc[dates[0], 'A']

-1.1821496820165085

In [213]:
df.at[dates[0],'A']

-1.1821496820165085

In [214]:
df.iloc[3] #select by position: 인덱스가 세번째인 것 가져옴

A   -0.751934
B    0.022619
C   -0.375465
D   -0.334886
Name: 2013-01-04 00:00:00, dtype: float64

In [215]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.751934  0.022619
2013-01-05  0.499891 -0.051273

In [216]:
df.iloc[1:3, :] #모든 열

                   A         B         C         D
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340 -0.462846 -0.149674  0.615237

In [217]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.508874  0.014910
2013-01-02  0.723699  1.344151
2013-01-03 -0.462846 -0.149674
2013-01-04  0.022619 -0.375465
2013-01-05 -0.051273 -0.221677
2013-01-06 -0.488644 -0.373304

In [218]:
df.iloc[1,1]

0.7236990387707626

In [219]:
df.iat[1,1] #position indexing

0.7236990387707626

## Boolean Indexing

In [220]:
df[df['A']>0]

                   A         B         C         D
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340 -0.462846 -0.149674  0.615237
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710
2013-01-06  0.926247 -0.488644 -0.373304  1.756561

In [221]:
df[df>0] #NaN 값 포함

                   A         B         C         D
2013-01-01       NaN       NaN  0.014910  0.490079
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340       NaN       NaN  0.615237
2013-01-04       NaN  0.022619       NaN       NaN
2013-01-05  0.499891       NaN       NaN       NaN
2013-01-06  0.926247       NaN       NaN  1.756561

In [222]:
df2 = df.copy()

In [223]:
df2

                   A         B         C         D
2013-01-01 -1.182150 -0.508874  0.014910  0.490079
2013-01-02  0.511163  0.723699  1.344151  1.477003
2013-01-03  1.541340 -0.462846 -0.149674  0.615237
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710
2013-01-06  0.926247 -0.488644 -0.373304  1.756561

In [224]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [225]:
df2

                   A         B         C         D      E
2013-01-01 -1.182150 -0.508874  0.014910  0.490079    one
2013-01-02  0.511163  0.723699  1.344151  1.477003    one
2013-01-03  1.541340 -0.462846 -0.149674  0.615237    two
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886  three
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710   four
2013-01-06  0.926247 -0.488644 -0.373304  1.756561  three

In [226]:
df2[df2['E'].isin(['two', 'four'])] #'E'열에서 two,four포함하는 열

                   A         B         C         D     E
2013-01-03  1.541340 -0.462846 -0.149674  0.615237   two
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710  four

In [227]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [228]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [229]:
df['F'] = s1

In [230]:
df

                   A         B         C         D    F
2013-01-01 -1.182150 -0.508874  0.014910  0.490079  NaN
2013-01-02  0.511163  0.723699  1.344151  1.477003  1.0
2013-01-03  1.541340 -0.462846 -0.149674  0.615237  2.0
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886  3.0
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710  4.0
2013-01-06  0.926247 -0.488644 -0.373304  1.756561  5.0

In [231]:
df.at[dates[0], 'A']=0

In [232]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.508874  0.014910  0.490079  NaN
2013-01-02  0.511163  0.723699  1.344151  1.477003  1.0
2013-01-03  1.541340 -0.462846 -0.149674  0.615237  2.0
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886  3.0
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710  4.0
2013-01-06  0.926247 -0.488644 -0.373304  1.756561  5.0

In [233]:
df.iat[0,1]=0

In [234]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.014910  0.490079  NaN
2013-01-02  0.511163  0.723699  1.344151  1.477003  1.0
2013-01-03  1.541340 -0.462846 -0.149674  0.615237  2.0
2013-01-04 -0.751934  0.022619 -0.375465 -0.334886  3.0
2013-01-05  0.499891 -0.051273 -0.221677 -3.175710  4.0
2013-01-06  0.926247 -0.488644 -0.373304  1.756561  5.0

In [235]:
df.loc[:,'D'] = np.array([5]*len(df)) #D값 바꿔줌

In [239]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.014910  5  NaN
2013-01-02  0.511163  0.723699  1.344151  5  1.0
2013-01-03  1.541340 -0.462846 -0.149674  5  2.0
2013-01-04 -0.751934  0.022619 -0.375465  5  3.0
2013-01-05  0.499891 -0.051273 -0.221677  5  4.0
2013-01-06  0.926247 -0.488644 -0.373304  5  5.0

In [240]:
df2 = df.copy()

In [241]:
df2[df2 > 0] = -df2

In [242]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.014910 -5  NaN
2013-01-02 -0.511163 -0.723699 -1.344151 -5 -1.0
2013-01-03 -1.541340 -0.462846 -0.149674 -5 -2.0
2013-01-04 -0.751934 -0.022619 -0.375465 -5 -3.0
2013-01-05 -0.499891 -0.051273 -0.221677 -5 -4.0
2013-01-06 -0.926247 -0.488644 -0.373304 -5 -5.0

## Missing Data

In [243]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [244]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  0.014910  5  NaN NaN
2013-01-02  0.511163  0.723699  1.344151  5  1.0 NaN
2013-01-03  1.541340 -0.462846 -0.149674  5  2.0 NaN
2013-01-04 -0.751934  0.022619 -0.375465  5  3.0 NaN

In [249]:
df1.loc[dates[0]:dates[1], 'E'] = 1

In [250]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.014910  5  NaN  1.0
2013-01-02  0.511163  0.723699  1.344151  5  1.0  1.0
2013-01-03  1.541340 -0.462846 -0.149674  5  2.0  1.0
2013-01-04 -0.751934  0.022619 -0.375465  5  3.0  NaN

In [251]:
df1.dropna(how='any') #어떤 컬럼이든 결측지 있으면 제거

                   A         B         C  D    F    E
2013-01-02  0.511163  0.723699  1.344151  5  1.0  1.0
2013-01-03  1.541340 -0.462846 -0.149674  5  2.0  1.0

In [253]:
df1.fillna(value=5) #na값을 5로 채워줌

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.014910  5  5.0  1.0
2013-01-02  0.511163  0.723699  1.344151  5  1.0  1.0
2013-01-03  1.541340 -0.462846 -0.149674  5  2.0  1.0
2013-01-04 -0.751934  0.022619 -0.375465  5  3.0  5.0

In [254]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False   True

In [255]:
df.mean()

A    0.454451
B   -0.042741
C    0.039823
D    5.000000
F    3.000000
dtype: float64

In [259]:
df.mean(1) #행별 평균값

2013-01-01    1.253727
2013-01-02    1.715803
2013-01-03    1.585764
2013-01-04    1.379044
2013-01-05    1.845388
2013-01-06    2.012860
Freq: D, dtype: float64

In [264]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2) #옮기기

In [265]:
s #아래로 두칸 내려감

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [267]:
df.sub(s, axis='index') #s에 na값 가지던 인덱스가 모두 nan으로 대체

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.541340 -1.462846 -1.149674  4.0  1.0
2013-01-04 -3.751934 -2.977381 -3.375465  2.0  0.0
2013-01-05 -4.500109 -5.051273 -5.221677  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [268]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.014910  5  NaN
2013-01-02  0.511163  0.723699  1.344151  5  1.0
2013-01-03  1.541340 -0.462846 -0.149674  5  2.0
2013-01-04 -0.751934  0.022619 -0.375465  5  3.0
2013-01-05  0.499891 -0.051273 -0.221677  5  4.0
2013-01-06  0.926247 -0.488644 -0.373304  5  5.0

In [269]:
df.apply(np.cumsum) #cumsum:누적합계

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.014910   5   NaN
2013-01-02  0.511163  0.723699  1.359061  10   1.0
2013-01-03  2.052503  0.260853  1.209387  15   3.0
2013-01-04  1.300569  0.283471  0.833922  20   6.0
2013-01-05  1.800460  0.232198  0.612245  25  10.0
2013-01-06  2.726707 -0.256446  0.238941  30  15.0

##### lambda: 새 함수 정의

In [270]:
df.apply(lambda x: x.max()-x.min())

A    2.293274
B    1.212343
C    1.719616
D    0.000000
F    4.000000
dtype: float64

## String Methods

In [271]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [272]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

In [273]:
df = pd.DataFrame(np.random.randn(10,4))

In [274]:
df

          0         1         2         3
0 -0.737435 -0.009066 -1.109884  2.629341
1  0.423629  0.224034 -0.377290 -0.437879
2  0.570186  0.476283 -1.647638  1.488841
3 -0.449600  1.542785  0.851330 -0.361951
4 -0.969689 -0.230391 -0.588307 -0.953479
5 -1.507564 -1.682440 -0.247240 -1.669546
6  0.130404  1.585734 -0.715185  0.922092
7  0.533169  0.107166 -1.251272 -0.440815
8  1.025141  1.299668  2.465346  0.499056
9 -0.438230  1.661191  0.378485 -2.131542

In [275]:
pieces = [df[:3], df[3:7], df[7:]]

In [276]:
pieces

[          0         1         2         3
 0 -0.737435 -0.009066 -1.109884  2.629341
 1  0.423629  0.224034 -0.377290 -0.437879
 2  0.570186  0.476283 -1.647638  1.488841,
           0         1         2         3
 3 -0.449600  1.542785  0.851330 -0.361951
 4 -0.969689 -0.230391 -0.588307 -0.953479
 5 -1.507564 -1.682440 -0.247240 -1.669546
 6  0.130404  1.585734 -0.715185  0.922092,
           0         1         2         3
 7  0.533169  0.107166 -1.251272 -0.440815
 8  1.025141  1.299668  2.465346  0.499056
 9 -0.438230  1.661191  0.378485 -2.131542]

In [277]:
pd.concat(pieces)

          0         1         2         3
0 -0.737435 -0.009066 -1.109884  2.629341
1  0.423629  0.224034 -0.377290 -0.437879
2  0.570186  0.476283 -1.647638  1.488841
3 -0.449600  1.542785  0.851330 -0.361951
4 -0.969689 -0.230391 -0.588307 -0.953479
5 -1.507564 -1.682440 -0.247240 -1.669546
6  0.130404  1.585734 -0.715185  0.922092
7  0.533169  0.107166 -1.251272 -0.440815
8  1.025141  1.299668  2.465346  0.499056
9 -0.438230  1.661191  0.378485 -2.131542

## Join

In [278]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [279]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [280]:
left

   key  lval
0  foo     1
1  foo     2

In [281]:
right

   key  rval
0  foo     4
1  foo     5

In [282]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [283]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [284]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [285]:
left

   key  lval
0  foo     1
1  bar     2

In [286]:
right

   key  rval
0  foo     4
1  bar     5

In [287]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Grouping

In [288]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                         'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                         'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)})

In [289]:
df

     A      B         C         D
0  foo    one -0.083879 -0.836934
1  bar    one  0.183143  0.656846
2  foo    two -0.455357 -0.140680
3  bar  three -0.916260 -1.394143
4  foo    two -0.788434  0.471712
5  bar    two  1.800987 -0.507053
6  foo    one  1.496885  0.621590
7  foo  three -0.272477 -0.272229

In [294]:
df.groupby('A')

In [295]:
df.groupby('A').sum()

            C         D
A
bar  1.067870 -1.244350
foo -0.103262 -0.156541

In [296]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.183143  0.656846
    three -0.916260 -1.394143
    two    1.800987 -0.507053
foo one    1.413006 -0.215344
    three -0.272477 -0.272229
    two   -1.243791  0.331032

## Reshaping

### Stack

In [297]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                              'foo', 'foo', 'qux', 'qux'],
                             ['one', 'two', 'one', 'two',
                              'one', 'two', 'one', 'two']]))

In [298]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [299]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [300]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [301]:
df

                     A         B
first second
bar   one     1.114179 -1.456833
      two    -1.146680  0.121531
baz   one     0.539312 -1.057511
      two    -1.505840 -0.003921
foo   one     0.634846 -1.200875
      two    -0.917130 -0.013460
qux   one     1.333590  1.095026
      two     0.113340 -0.327763

In [302]:
df2 = df[:4]

In [303]:
df2

                     A         B
first second
bar   one     1.114179 -1.456833
      two    -1.146680  0.121531
baz   one     0.539312 -1.057511
      two    -1.505840 -0.003921

In [304]:
stacked = df2.stack()

In [305]:
stacked

first  second
bar    one     A    1.114179
               B   -1.456833
       two     A   -1.146680
               B    0.121531
baz    one     A    0.539312
               B   -1.057511
       two     A   -1.505840
               B   -0.003921
dtype: float64

In [306]:
stacked.unstack()

                     A         B
first second
bar   one     1.114179 -1.456833
      two    -1.146680  0.121531
baz   one     0.539312 -1.057511
      two    -1.505840 -0.003921

In [307]:
stacked.unstack(1) #행과 열을 바꿔서 출력

second        one       two
first
bar   A  1.114179 -1.146680
      B -1.456833  0.121531
baz   A  0.539312 -1.505840
      B -1.057511 -0.003921

In [308]:
stacked.unstack(0)

first          bar       baz
second
one    A  1.114179  0.539312
       B -1.456833 -1.057511
two    A -1.146680 -1.505840
       B  0.121531 -0.003921

## Time Series

In [309]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [310]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [311]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [312]:
ts

2012-01-01 00:00:00    299
2012-01-01 00:00:01    226
2012-01-01 00:00:02    469
2012-01-01 00:00:03    496
2012-01-01 00:00:04    179
                      ...
2012-01-01 00:01:35    384
2012-01-01 00:01:36     37
2012-01-01 00:01:37     85
2012-01-01 00:01:38    140
2012-01-01 00:01:39    343
Freq: S, Length: 100, dtype: int32

In [313]:
ts.resample('5Min')

In [314]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [315]:
ts = pd.Series(np.random.randn(len(rng)),rng)

In [316]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [317]:
ts

2012-03-06    0.209000
2012-03-07   -2.381917
2012-03-08    1.421355
2012-03-09   -0.203692
2012-03-10   -1.367402
Freq: D, dtype: float64

In [318]:
ts_utc = ts.tz_localize('UTC')

In [319]:
ts_utc

2012-03-06 00:00:00+00:00    0.209000
2012-03-07 00:00:00+00:00   -2.381917
2012-03-08 00:00:00+00:00    1.421355
2012-03-09 00:00:00+00:00   -0.203692
2012-03-10 00:00:00+00:00   -1.367402
Freq: D, dtype: float64

In [320]:
ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00    0.209000
2012-03-06 19:00:00-05:00   -2.381917
2012-03-07 19:00:00-05:00    1.421355
2012-03-08 19:00:00-05:00   -0.203692
2012-03-09 19:00:00-05:00   -1.367402
Freq: D, dtype: float64

In [323]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [324]:
rng

DatetimeIndex(['2012-01-31', '2012-02-29', '2012-03-31', '2012-04-30',
               '2012-05-31'],
              dtype='datetime64[ns]', freq='M')

In [325]:
ts = pd.Series(np.random.randn(len(rng)),index=rng)

In [326]:
ts

2012-01-31   -0.977010
2012-02-29    1.169626
2012-03-31   -0.576867
2012-04-30    0.077242
2012-05-31    1.098957
Freq: M, dtype: float64

In [327]:
ps = ts.to_period()

In [328]:
ps

2012-01   -0.977010
2012-02    1.169626
2012-03   -0.576867
2012-04    0.077242
2012-05    1.098957
Freq: M, dtype: float64

In [329]:
ps.to_timestamp()

2012-01-01   -0.977010
2012-02-01    1.169626
2012-03-01   -0.576867
2012-04-01    0.077242
2012-05-01    1.098957
Freq: MS, dtype: float64

In [330]:
 prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

In [331]:
ts = pd.Series(np.random.randn(len(prng)),prng)

In [332]:
ts

1990Q1    0.062773
1990Q2   -0.073120
1990Q3    0.774818
1990Q4    2.270003
1991Q1   -0.343327
1991Q2   -0.386661
1991Q3    0.203005
1991Q4    0.500866
1992Q1   -1.795521
1992Q2    0.569138
1992Q3   -0.684130
1992Q4    0.074416
1993Q1   -0.739876
1993Q2   -1.657126
1993Q3   -0.743824
1993Q4    1.869628
1994Q1    0.621362
1994Q2    1.584438
1994Q3    0.129178
1994Q4   -0.156545
1995Q1    0.561366
1995Q2    0.454133
1995Q3   -0.553415
1995Q4    1.566911
1996Q1   -0.750403
1996Q2   -1.285973
1996Q3   -1.110756
1996Q4   -0.174961
1997Q1    1.053446
1997Q2    1.432765
1997Q3   -0.153288
1997Q4   -0.251068
1998Q1    0.465851
1998Q2    1.435073
1998Q3    0.050540
1998Q4   -0.557163
1999Q1   -1.211197
1999Q2   -0.519934
1999Q3   -1.352802
1999Q4    1.979365
2000Q1    0.017541
2000Q2    0.953089
2000Q3    0.020519
2000Q4   -0.846467
Freq: Q-NOV, dtype: float64

In [333]:
ts.index = (prng.asfreq('M','e')+1).asfreq('H','s')+9
#매달 마지막 날에 +1 하면 그 다음 달 첫날, 아침9시

In [334]:
ts.head()

1990-03-01 09:00    0.062773
1990-06-01 09:00   -0.073120
1990-09-01 09:00    0.774818
1990-12-01 09:00    2.270003
1991-03-01 09:00   -0.343327
Freq: H, dtype: float64

## Categoricals

In [336]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
                   "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})

In [337]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [338]:
df["grade"] = df["raw_grade"].astype("category")

In [339]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

In [340]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [341]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): ['very good', 'good', 'very bad']

In [342]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium","good", "very good"])

In [344]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

In [345]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [346]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [347]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64